#ifndef __WARNING_CLIENT_H__
#define __WARNING_CLIENT_H__

#include "JuceHeader.h"
// ÐèÒªÓëCommunication³ÌÐòµÄ¶¨Òå±£³ÖÒ»ÖÂ
#include "CameraDataModel.h"
// ÐèÒªÓëCommunication³ÌÐòµÄ¶¨Òå±£³ÖÒ»ÖÂ
typedef struct _warning_mes {
	int		ip;						// Î²ºÅip
	int		type;					// ÀàÐÍ£¬1±¨¾¯or2Í£»ú
	char	workStation[512];		// »úÌ¨ÐÅÏ¢
	char	mes[512];				// ¾ßÌåÐÅÏ¢
	bool	isSend2Plc;				// ÊÇ·ñ³É¹¦·¢ËÍµ½plc
	char	cTime[512];				// µ±Ç°Ê±¼ä
}WARNING_MES;
typedef struct __INTER_MESSAGE
{
	int		_spec;	// ÏûÏ¢µÄÌØ¶¨±àÂë201404£¬Èç¹û²»ÊÇ´Ë±àÂë£¬ÔòºöÂÔÏûÏ¢
	int		_flag;	// ÏûÏ¢±êÖ¾£¬< 0£ºÊý¾Ý/×´Ì¬£¬> 0£ºÃüÁî¡£¾ßÌåµÄÊý×Ö±íÊ¾ÏàÓ¦µÄÊý¾Ý»òÃüÁî
	// -1£º×óÌù±ê»úµÄÌù±ê×ø±ê£¬-2£ºÓÒÌù±ê»úµÄÌù±ê×ø±ê
	// -5£º±¨¾¯£¬-6£ºCCDÏµÍ³µ±Ç°×´Ì¬£¬-8£ºÑÏÖØ´íÎó/±¨¾¯£¬Éè±¸ÐèÒªÍ£»ú
	// -7£ºµ±Ç°Éè±¸×ÝÏò×ø±ê£¬-9£ºÉè±¸×´Ì¬±ä¸ü
	// 1£º×ÝÏò×ø±êÇåÁã£¬2£ºTizerACÏòCommunication²éÑ¯µ±Ç°Éè±¸×ÝÏò×ø±ê
	// -11£ºº£Ä¿ÐÇÇÐ¸î·ÖÌõ»úÌù±ê²âÊÔ×ø±êÎ»ÖÃ£¬µ½MD5000
	// -12£ºÓë-11Ïà¹Ø£¬Ìù±êÎ»ÖÃ¸ø³öºó£¬¸ø³ö±êÖ¾Î»MD5003
	// -13: CCD·¢ËÍ¾ÀÆ«±Õ»·ÉÏÏà»úÍ¿¸²Çø¿í¶È»ò×ó²à¼«¶úÍ¿¸²¸ß¶È£¬¶ÔÓ¦MD13534
	// -14: CCD·¢ËÍ¾ÀÆ«±Õ»·ÏÂÏà»úÍ¿¸²Çø¿í¶È»òÓÒ²à¼«¶úÍ¿¸²¸ß¶È£¬¶ÔÓ¦MD13534
	// -15: CCD·¢ËÍ¾ÀÆ«±Õ»·ÉÏÏà»úÒÑ¼ì²â¼«¶úÊýÁ¿»ò×ó²àÒÑ¼ì²â¼«¶úÊýÁ¿£¬¶ÔÓ¦MD13536
	// -16: CCD·¢ËÍ¾ÀÆ«±Õ»·ÏÂÏà»úÒÑ¼ì²â¼«¶úÊýÁ¿»òÓÒ²àÒÑ¼ì²â¼«¶úÊýÁ¿£¬¶ÔÓ¦MD13540
	// -17: CCDµ±Ç°²âµÃµÄÉÏ´øÂ·×Ü³¤£¬¶ÔÓ¦MD13808
	// -18: CCDµ±Ç°²âµÃµÄÏÂ´øÂ·×Ü³¤£¬¶ÔÓ¦MD13809
	// -19: ·¢ËÍ20¸ö×Ö½ÚµÄÄ¤¾íºÅµ½TizerAC
	// -20: TizerACÏòCommunicationÇëÇó·¢ËÍINTER_MESSAGE_LASER_SIZE¡£Ò»°ãÓÃÓÚÄ£Äâ½áÊøºó£¬»Ö¸´Êµ»ú»·¾³ÓÃ
	// -21: CCD·¢ËÍÁ¼Æ·Êý¾Ý
	// -22: CCD·¢ËÍ²»Á¼Æ·Êý¾Ý
	// -23: CCDÁ¼Æ·/²»Á¼Æ·¼ÆÊýÇåÁã¡£Communication->TizerAC
	// -24: TizerAC·¢ËÍµÄËã·¨Ä£¿é´æ»îµÄÐÄÌø£¬Èç¹ûÒ»¶ÎÊ±¼äCommunicationÃ»ÓÐÊÕµ½´ËÏûÏ¢£¬Ôò±íÊ¾Ëã·¨Ä£¿éÒÑÊ§Ð§
	// -30: Õë¶ÔÅ·Ä·ÁúÐ­Òév5.0£¬¼ÓÈëÍ£»ú¸´Î»ÃüÁî¡£Èç¹ûCCD·¢ÉúÎÊÌâµ¼ÖÂÍ£»ú£¬ÓÉCCD·¢ËÍ´ËÃüÁîµ½PLC£¬²ÅÄÜ¿ªÊ¼¼ÌÐøÔËÐÐ

		/*
	-190£º¸÷¹¤Î»ÊÕµ½Ä¤¾íºÅ½âÎö°ü
	*/

	/*		DM20004±¨¾¯µØÖ·,Tizer To Plc
	-40£º¾ÀÆ«¹¤Î»1 ÔËÐÐÒì³£
	-41£ºÉÏ´øÂ· ¼«¶ú¼ì²â ÔËÐÐÒì³£
	-42£ºÉÏ´øÂ· è¦´Ã¼ì²â ÔËÐÐÒì³£
	-43£ºÉÏ´øÂ· ¾ÀÆ«¹¤Î» ÔËÐÐÒì³£
	-44£ºÉÏ´øÂ· ·ÖÌõ²â¿í ÔËÐÐÒì³£
	-45£ºÏÂ´øÂ· ¼«¶ú¼ì²â ÔËÐÐÒì³£
	-46£ºÏÂ´øÂ· è¦´Ã¼ì²â ÔËÐÐÒì³£
	-47£ºÏÂ´øÂ· ¾ÀÆ«¹¤Î» ÔËÐÐÒì³£
	-48£ºÏÂ´øÂ· ·ÖÌõ²â¿í ÔËÐÐÒì³£
	*/

	/*		DM20008ÑÏÖØ±¨¾¯²¢Í£»úµØÖ·,CCD·¢ËÍµ½plcÒÔ¹©ÉÏÎ»»úÍ£»ú,Tizer To Plc
	-80£º¾ÀÆ«¹¤Î»1±¨¾¯Í£»ú
	-81£ºÉÏ´øÂ· ¼«¶ú¼ì²â ±¨¾¯Í£»ú
	-82£ºÉÏ´øÂ· è¦´Ã¼ì²â ±¨¾¯Í£»ú
	-83£ºÉÏ´øÂ· ¾ÀÆ«¹¤Î» ±¨¾¯Í£»ú
	-84£ºÉÏ´øÂ· ·ÖÌõ²â¿í ±¨¾¯Í£»ú
	-85£ºÏÂ´øÂ· ¼«¶ú¼ì²â ±¨¾¯Í£»ú
	-86£ºÏÂ´øÂ· è¦´Ã¼ì²â ±¨¾¯Í£»ú
	-87£ºÏÂ´øÂ· ¾ÀÆ«¹¤Î» ±¨¾¯Í£»ú
	-88£ºÏÂ´øÂ· ·ÖÌõ²â¿í ±¨¾¯Í£»ú
	-89£ºÉÏ´øÂ· ÄÚ²âÌù±ê»úÈ±±ê ±¨¾¯Í£»ú ´øÂ·1
	-90£ºÉÏ´øÂ· Íâ²àÌù±ê»úÈ±±ê ±¨¾¯Í£»ú ´øÂ·2
	-91£ºÏÂ´øÂ· ÄÚ²âÌù±ê»úÈ±±ê ±¨¾¯Í£»ú ´øÂ·3
	-92£ºÏÂ´øÂ· Íâ²àÌù±ê»úÈ±±ê ±¨¾¯Í£»ú ´øÂ·4

	-99£º¾ÀÆ«Æ÷ÏÞÎ»Í£»ú£¡
	*/

	/*		DM20116Éè±¸×´Ì¬¸Ä±äµØÖ·,PLC To Tizer
	-60£ºÉè±¸Í£»ú
	-61£ºÉè±¸Õý³£ÔËÐÐ
	-62£ºÉè±¸µ÷ÊÔ


	-65£º·¢ËÍËÙ¶Èµ½´ò±ê»ú·þÎñÆ÷

	-66£º·¢ËÍ¾ÀÆ«Æ÷Æ«ÒÆÁ¿µ½PLC
	*/

	/*		DM20012¸÷¹¤Î»»»¾íÐÅºÅ£¬	DM20016£¬Ö¸¶¨¹¤Î»»»¾í	PLC->TizerºóTizer->PLC
	-120£ºËùÓÐCCD¹¤Î»»»¾íÍê³ÉºóÐ´0£¬
	-121£ºËùÓÐCCD¹¤Î»¿ªÊ¼»»¾í²Ù×÷
	-160£ºÉÏ´øÂ· ¼«¶ú¼ì²â »»¾í
	-161£ºÉÏ´øÂ· è¦´Ã¼ì²â »»¾í
	-162£ºÉÏ´øÂ· ·ÖÌõ²â¿í »»¾í
	-163£ºÏÂ´øÂ· ¼«¶ú¼ì²â »»¾í
	-164£ºÏÂ´øÂ· è¦´Ã¼ì²â »»¾í
	-165£ºÏÂ´øÂ· ·ÖÌõ²â¿í »»¾í
	*/

	/*
	-70£º¿Í»§¶Ëµ½communicationµÄÐÄÌøÐÅºÅ,ÔÝ¶¨Ã¿Ãë·¢Ò»´Î

	-71£º¼¤¹âÆ«ÒÆ£¬±Õ»·ÓÃ£¬dataÎª¼¤¹â±àºÅ£¬value[0]ÎªÆ«ÒÆÁ¿£¬¸ºÎªÏòÄÚ
	-72£º12¼¤¹âÕûÌåÆ«ÒÆ
	-73£º34¼¤¹âÕûÌåÆ«ÒÆ

	-75£º¹¤Î»1µÄ4Á¬±ê¿ªÊ¼±êÖ¾»òÕßÍê³É±êÖ¾,¿Í»§¶ËÊÕµ½Ö¸ÁîÖ´ÐÐ¶¯×÷£¬Íê³ÉºóÏò·þÎñÆ÷·¢´Ëflag±íÊ¾Íê³É¶¯×÷
	-76£º¹¤Î»2µÄ4Á¬±ê¿ªÊ¼±êÖ¾»òÕßÍê³É±êÖ¾,¿Í»§¶ËÊÕµ½Ö¸ÁîÖ´ÐÐ¶¯×÷£¬Íê³ÉºóÏò·þÎñÆ÷·¢´Ëflag±íÊ¾Íê³É¶¯×÷
	-77£º¹¤Î»3µÄ4Á¬±ê¿ªÊ¼±êÖ¾»òÕßÍê³É±êÖ¾,¿Í»§¶ËÊÕµ½Ö¸ÁîÖ´ÐÐ¶¯×÷£¬Íê³ÉºóÏò·þÎñÆ÷·¢´Ëflag±íÊ¾Íê³É¶¯×÷
	-78£º¹¤Î»4µÄ4Á¬±ê¿ªÊ¼±êÖ¾»òÕßÍê³É±êÖ¾,¿Í»§¶ËÊÕµ½Ö¸ÁîÖ´ÐÐ¶¯×÷£¬Íê³ÉºóÏò·þÎñÆ÷·¢´Ëflag±íÊ¾Íê³É¶¯×÷
	*/

	int		_dir;	// ´«Êä·½Ïò£¬0£ºTizerAC->Communication£¬1£ºCommunication->TizerAC
	int		_data;	// Êý¾Ý»òÃüÁî²ÎÊý
	int		_value[5];	// ¸½´øµÄÖµ¡£
	// µ±_flag = -5±¨¾¯Ê±£¬±íÊ¾¸Ã±¨¾¯³öÏÖÔÚ£º
	// _value[0]: 0£º²»Çø·Ö´øÂ·£¬1£º´øÂ·1£¬2£º´øÂ·2£¬3£º´øÂ·3£¬...
	// _value[1]: 0£º²»Çø·ÖÕý·´Ãæ£¬1£ºÕýÃæ£¬2£º·´Ãæ
	// µ±_flag = -21£¬-22Ê±£¬
	// _value[0]: 0£º²»Çø·Ö´øÂ·£¬1£º´øÂ·1£¬2£º´øÂ·2£¬3£º´øÂ·3£¬...
} INTER_MESSAGE;


// Óë´ò±ê·þÎñÆ÷µÄÍ¨ÐÅ
class WarningClient : public juce::InterprocessConnection
{
	double m_speed;
	
public:
	WarningClient();
	juce::int64 m_recTime;
	virtual void connectionMade();
	virtual void connectionLost();
	virtual void messageReceived(const juce::MemoryBlock& message);

	int		SendData(INTER_MESSAGE& data);

	void	SetComponent(juce::Component* mainComponent) { _mainComponent = mainComponent; }
	

	double GetMachineSpeed();
private:
	juce::Component*		_mainComponent;
};

class MainFormClient : public juce::InterprocessConnection
{

public:
	MainFormClient();

	virtual void connectionMade();
	virtual void connectionLost();
	virtual void messageReceived(const juce::MemoryBlock& message);

	int		SendData(StickMarkInfo& data);

	void	SetComponent(juce::Component* mainComponent) { _mainComponent = mainComponent; }
	int		SendMsgData(bool bNewUI, juce::String data);
	int		SendData(WS_INFO& header, WARNING_MSG& data);
	int     SendData(NumCount& numcount);

private:
	juce::Component* _mainComponent;
};
#endif // __STICK_CLIENT_H__